export const mockQuestions = [
  {
    id: 1,
    title:
      'Зачем необходимо применение процесса легирования при создании структуры полупроводниковой ИМС?',
    testId: 2,
  },
  {
    id: 2,
    title: 'Как описывается эффект диффузии?',
    testId: 2,
  },
  {
    id: 3,
    title: 'В каком виде легирующее вещество обеспечивает наилучшую равномерность легирования?',
    testId: 2,
  },
  {
    id: 4,
    title:
      'Какие вещества при легировании используются для создания электронного типа проводимости?',
    testId: 2,
  },
  {
    id: 5,
    title: 'Какие вещества при легировании используются для создания дырочного типа проводимости?',
    testId: 2,
  },
  {
    id: 6,
    title: 'Какие виды газообразных веществ используют для легирования кремниевых подложек?',
    testId: 2,
  },
  {
    id: 7,
    title: 'Какие режимы высокотемпературного легирования используют при обработке кремния?',
    testId: 2,
  },
  {
    id: 8,
    title:
      'Ограничивает ли предел растворимости предельно достижимую концентрацию при процессе высокотемпературного легирования?',
    testId: 2,
  },
  {
    id: 9,
    title:
      'Есть ли возможность раздельного контроля глубины легированного слоя и концентрации примеси в нем при высокотемпературном легировании?',
    testId: 2,
  },
  {
    id: 10,
    title: 'Выберите характеристику не присущую процессу плазменного травления:',
    testId: 1,
  },
  {
    id: 11,
    title: 'Анизотропия – это преимущественное удаление материала пластины ...',
    testId: 1,
  },
  {
    id: 12,
    title: 'Отношение скоростей травления двух различных материалов, в одной и той же плазме, это:',
    testId: 1,
  },
  {
    id: 13,
    title:
      'Понятие «Загрузочный эффект» отображает степень ... газовой фазы активным травителем в процессе травления.',
    testId: 1,
  },
  {
    id: 14,
    title: 'В реальных процессах вытравленная область:',
    testId: 1,
  },
  {
    id: 15,
    title:
      'Чтобы компенсировать размытие рельефа (подтравливание) во время изотропного травления, диаметр отверстий в маске:',
    testId: 1,
  },
  {
    id: 16,
    title:
      'Минимальный размер элементов топологии, достижимый при использовании метода изотропного травления ограничен:',
    testId: 1,
  },
  {
    id: 17,
    title: 'Для изготовления строго заданного рельефа необходимо:',
    testId: 1,
  },
  {
    id: 18,
    title:
      'Чем просто и экономично выполняют операции селективного удаления фоторезиста, травления топологических элементов больших размеров в кремнии и удаления оксидируемых нитридных масок?',
    testId: 1,
  },
  {
    id: 19,
    title:
      'Какие травители применяют для травления диэлектрических пленок под созданными фоторезистивными масками?',
    testId: 1,
  },
  {
    id: 20,
    title: 'Как производят удаление металла напыленного на маску?',
    testId: 1,
  },
  {
    id: 21,
    title:
      'Для удаления толстой вертикальной части слоя (например, поликремния) на краю ступеньки и для сглаживания рельефа, что облегчает осаждение покрытия на ступеньку, используют:',
    testId: 1,
  },
  {
    id: 22,
    title:
      'Чем обусловлен загрузочный эффект резкого увеличения скорости травления используя изотропные травители?',
    testId: 1,
  },
  {
    id: 23,
    title: 'Что служит хорошим индикатором селективности травления?',
    testId: 1,
  },
  {
    id: 24,
    title:
      'Сколько составляет отношение скоростей травления поверхности (100) кремния и термического оксида (SiO2) атомами фтора при комнатной температуре и при 100 °С?',
    testId: 1,
  },
  {
    id: 25,
    title:
      'Операции селективного удаления фоторезиста, травления топологических элементов больших размеров в кремнии и удаления оксидируемых нитридных масок просто и экономично выполняют, используя:',
    testId: 1,
  },
  {
    id: 26,
    title: 'Что вызывает резкое увеличение скорости травления перед окончанием травления?',
    testId: 1,
  },
  {
    id: 27,
    title:
      'Чем может ограничиваться перенос травителя из объема плазмы к поверхности при неблагоприятном сочетании давления, скоростей потока и реакций?',
    testId: 1,
  },
  {
    id: 28,
    title:
      'Что влияет на локальную скорость травления и ведет к различию скоростей травления при разных видах топологии?',
    testId: 1,
  },
  {
    id: 29,
    title: 'Какая поверхность травится более равномерно в плазме фтора или фторсодержащих веществ?',
    testId: 1,
  },
  {
    id: 30,
    title:
      'Что делает хлорсодержащая плазма (CF 3 Cl или Cl2 при высокой частоте и при давлении выше 10 Па) с поверхностью кремния?',
    testId: 1,
  },
  {
    id: 31,
    title:
      'Процесс удаления атомов с поверхности под воздействием потока высокоэнергетичных ионов это:',
    testId: 1,
  },
  {
    id: 32,
    title:
      'Чем определяется диапазон энергий, характерных для процессов ионно-плазменной обработки',
    testId: 1,
  },
  {
    id: 33,
    title: 'Какую энергию ионов на производстве общепринято относить к процессам распыления?',
    testId: 1,
  },
  {
    id: 34,
    title: 'Чем является низкоэнергетическая плазма (энергия ионов ниже 15 эВ)?',
    testId: 1,
  },
  {
    id: 35,
    title:
      'Что наблюдается если производится травление канавок через неповреждаемую маску в течении длительного времени?',
    testId: 1,
  },
  {
    id: 36,
    title:
      'Зачем необходимо применение процесса легирования при создании структуры полупроводниковой ИМС?',
    testId: 3,
  },
  {
    id: 37,
    title:
      'Какие вещества при легировании используются для создания электронного типа проводимости?',
    testId: 3,
  },
  {
    id: 38,
    title: 'Какие вещества при легировании используются для создания дырочного типа проводимости?',
    testId: 3,
  },
  {
    id: 39,
    title:
      'Ограничивает ли предел растворимости предельно достижимую концентрацию при процессе ионного легирования?',
    testId: 3,
  },
  {
    id: 40,
    title:
      'Есть ли возможность раздельного контроля глубины легированного слоя и концентрации примеси в нем при ионном легировании?',
    testId: 3,
  },
  {
    id: 41,
    title: 'Метод ионного легирования это …',
    testId: 3,
  },
  {
    id: 42,
    title:
      'Каким параметром процесса ионного легирования задается глубина залегания внедряемой примеси?',
    testId: 3,
  },
  {
    id: 43,
    title: 'При какой температуре проводится процесс ионного легирования?',
    testId: 3,
  },
  {
    id: 44,
    title:
      'Каким параметром процесса ионного легирования задается концентрация внедряемой примеси?',
    testId: 3,
  },
  {
    id: 45,
    title: 'Эффект каналирования при ионном легировании…',
    testId: 3,
  },
  {
    id: 46,
    title: 'В подложках с какой ориентацией эффект каналирования проявляется сильнее всего?',
    testId: 3,
  },
  {
    id: 47,
    title:
      'Что необходимо сделать для снижения вероятности процесса каналирования при ионном легировании?',
    testId: 3,
  },
  {
    id: 48,
    title:
      'Механизм атомного торможения имплантированных ионов преобладает над механизмом электронного торможения при …',
    testId: 3,
  },
  {
    id: 49,
    title: 'Какая сила действует на заряженные частицы в массепараторе ионного имплантера?',
    testId: 3,
  },
  {
    id: 50,
    title: 'Масссепаратор в ионном имплантате необходим для…',
    testId: 3,
  },
  {
    id: 51,
    title: 'Отжиг подложек после операции ионной имплантации проводят для …',
    testId: 3,
  },
  {
    id: 52,
    title: 'Зачем в процессе ионной имплантации используется вращающийся диск с подложками?',
    testId: 3,
  },
  {
    id: 53,
    title: 'При ионном легировании глубже приникает какой ион?',
    testId: 3,
  },
  {
    id: 54,
    title: 'Активация имплантированных ионов примеси – это…',
    testId: 3,
  },
  {
    id: 55,
    title: 'Почему для ионного легирования важна чистота поверхности?',
    testId: 3,
  },
  {
    id: 56,
    title: 'Процесс газофазной эпитаксии кремния позволяет формировать…',
    testId: 4,
  },
  {
    id: 57,
    title: 'Основные методы получения эпитаксиальных пленок кремния из паро-газовой фазы?',
    testId: 4,
  },
  {
    id: 58,
    title: 'Основные типы газофазных эпитаксиальных реакторов для кремниевой технологии?',
    testId: 4,
  },
  {
    id: 59,
    title: 'Молекулярно - лучевая эпитаксия – это процесс …',
    testId: 4,
  },
  {
    id: 60,
    title:
      'Зачем при процессе эпитаксии в горизонтальных реакторах подложки размещаются на наклонном пьедестале?',
    testId: 4,
  },
  {
    id: 61,
    title: 'В чём преимущества использования моносилана перед дихлорсиланом для эпитаксии?',
    testId: 4,
  },
  {
    id: 62,
    title: 'Каких реакторов не существует для процесса эпитаксии?',
    testId: 4,
  },
  {
    id: 63,
    title:
      'Может ли использоваться газофазная эпитаксия для создания биполярного и КМОП транзисторов?',
    testId: 4,
  },
  {
    id: 64,
    title:
      'При какой температуре процесса эпитаксии из моносилана на подложке формируется монокристаллическая структура?',
    testId: 4,
  },
  {
    id: 65,
    title: 'Для чего используется скруббер в процессах эпитаксиального осаждения?',
    testId: 4,
  },
  {
    id: 66,
    title: 'Зачем применяется сжигание в кислороде газов, выходящих из эпитаксиального реактора?',
    testId: 4,
  },
  {
    id: 67,
    title: 'В каком диапазоне температур идет процесс эпитаксиального наращивания кремния?',
    testId: 4,
  },
  {
    id: 68,
    title: '',
    testId: 5,
  },
  {
    id: 69,
    title: '',
    testId: 5,
  },
  {
    id: 70,
    title: '',
    testId: 5,
  },
]
